Repository: bigocox1970/TubeTrainer-swift
Catalog: TubeTrainer/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, pt_br

source: Opens YouTube for “%@”. Pick a video you like, tap Share → TubeTrainer (or copy the link and paste it above) to set it as your coach.
de: Öffnet YouTube für „%@“. Wähle ein Video, das dir gefällt, tippe auf Teilen → TubeTrainer (oder kopiere den Link und füge ihn oben ein), um es als deinen Trainer festzulegen.
es: Abre YouTube para «%@». Elige un vídeo que te guste, toca Compartir → TubeTrainer (o copia el enlace y pégalo arriba) para ponerlo como tu entrenador.
pt_br: Abre o YouTube para «%@». Escolha um vídeo que você goste, toque em Compartilhar → TubeTrainer (ou copie o link e cole acima) para defini-lo como seu treinador.

source: Other
de: Sonstige
es: Otro
pt_br: Outro

source: Overhead Triceps Extension
de: Trizeps-Überkopfdrücken
es: Extensión de tríceps sobre la cabeza
pt_br: Extensão de tríceps acima da cabeça

source: Paste key
de: Schlüssel einfügen
es: Pegar clave
pt_br: Colar chave

source: Paste YouTube link
de: YouTube-Link einfügen
es: Pega el enlace de YouTube
pt_br: Cole o link do YouTube

source: Pec Deck
de: Pec Deck (Butterfly)
es: Contractora de pecho
pt_br: Voador (pec deck)

source: Personal Records
de: Persönliche Rekorde
es: Récords personales
pt_br: Recordes pessoais

source: Pick a training structure
de: Wähle eine Trainingsstruktur
es: Elige una estructura de entrenamiento
pt_br: Escolha uma estrutura de treino

source: Plank
de: Unterarmstütz
es: Plancha
pt_br: Prancha

source: Play coaching video: %@
de: Trainingsvideo abspielen: %@
es: Reproducir vídeo de entrenamiento: %@
pt_br: Reproduzir vídeo de treino: %@

source: Prefer results right here? Add a free key in Settings → YouTube search key.
de: Lieber Ergebnisse direkt hier? Füge in Einstellungen → YouTube-Suchschlüssel einen kostenlosen Schlüssel hinzu.
es: ¿Prefieres los resultados aquí mismo? Añade una clave gratuita en Ajustes → Clave de búsqueda de YouTube.
pt_br: Prefere os resultados aqui mesmo? Adicione uma chave gratuita em Ajustes → Chave de busca do YouTube.

source: Press and hold any exercise to add it here — handy for movements outside your usual split.
de: Halte eine Übung gedrückt, um sie hier hinzuzufügen — praktisch für Übungen außerhalb deines üblichen Splits.
es: Mantén pulsado cualquier ejercicio para añadirlo aquí; útil para movimientos fuera de tu rutina habitual.
pt_br: Mantenha pressionado qualquer exercício para adicioná-lo aqui — útil para movimentos fora da sua divisão habitual.

source: PREV
de: VORH
es: ANT
pt_br: ANT

source: Previous
de: Zurück
es: Anterior
pt_br: Anterior

source: Privacy
de: Datenschutz
es: Privacidad
pt_br: Privacidade

source: Profile
de: Profil
es: Perfil
pt_br: Perfil

source: Pull Day
de: Pull-Tag
es: Día de tirón
pt_br: Treino Pull

source: Pull-Up
de: Klimmzug
es: Dominadas
pt_br: Barra fixa

source: Push Day
de: Push-Tag
es: Día de empuje
pt_br: Treino Push

source: Push-Up
de: Liegestütze
es: Flexiones
pt_br: Flexão

source: Quadriceps
de: Quadrizeps
es: Cuádriceps
pt_br: Quadríceps

source: READY
de: BEREIT
es: LISTO
pt_br: PRONTO

source: Rear Delt Fly
de: Reverse Fly
es: Aperturas posteriores
pt_br: Crucifixo inverso

source: Recent coaching
de: Zuletzt hinzugefügt
es: Vídeos recientes
pt_br: Vídeos recentes

source: RECHARGING
de: ERHOLUNG
es: RECARGANDO
pt_br: RECARREGANDO

source: Remove
de: Entfernen
es: Quitar
pt_br: Remover

source: Remove coach
de: Trainer entfernen
es: Quitar entrenador
pt_br: Remover treinador

source: Remove from favourites
de: Aus Favoriten entfernen
es: Quitar de favoritos
pt_br: Remover dos favoritos

source: Remove from Favourites
de: Aus Favoriten entfernen
es: Quitar de favoritos
pt_br: Remover dos favoritos

source: Remove key
de: Schlüssel entfernen
es: Quitar clave
pt_br: Remover chave

source: Removes your current workouts and creates %@. Your logged history is kept.
de: Entfernt deine aktuellen Trainings und erstellt %@. Dein protokollierter Verlauf bleibt erhalten.
es: Elimina tus entrenamientos actuales y crea %@. Tu historial registrado se conserva.
pt_br: Remove seus treinos atuais e cria %@. Seu histórico registrado é mantido.

source: Rename workout
de: Training umbenennen
es: Renombrar entrenamiento
pt_br: Renomear treino

source: Replace everything
de: Alles ersetzen
es: Reemplazar todo
pt_br: Substituir tudo

source: Replace with %@
de: Durch %@ ersetzen
es: Reemplazar por %@
pt_br: Substituir por %@

source: Replace your workouts with a split
de: Ersetze deine Trainings durch einen Split
es: Reemplaza tus entrenamientos por una rutina
pt_br: Substitua seus treinos por uma divisão

source: REPS
de: WDH.

source: Reset your split?
de: Deinen Split zurücksetzen?
es: ¿Restablecer tu rutina?
pt_br: Redefinir sua divisão?

source: Rest
de: Pause
es: Descanso
pt_br: Descanso

source: Rest alert sound
de: Pausen-Signalton
es: Sonido de aviso de descanso
pt_br: Som de aviso de descanso

source: Rest timer
de: Pausen-Timer
es: Temporizador de descanso
pt_br: Timer de descanso

source: Restore backup
de: Backup wiederherstellen
es: Restaurar copia
pt_br: Restaurar backup

source: Restored %lld items.
de: %lld Einträge wiederhergestellt.
es: %lld elementos restaurados.
pt_br: %lld itens restaurados.

source: Retry
de: Erneut versuchen
es: Reintentar
pt_br: Tentar novamente

source: Romanian Deadlift
de: Rumänisches Kreuzheben
es: Peso muerto rumano
pt_br: Levantamento terra romeno

source: Rowing Machine
de: Rudergerät
es: Máquina de remo
pt_br: Máquina de remo

source: Save
de: Speichern
es: Guardar
pt_br: Salvar

source: Save key
de: Schlüssel speichern
es: Guardar clave
pt_br: Salvar chave

source: Save the best exercise coaching you find on YouTube and keep it right beside your workout.
de: Speichere die besten Übungsvideos, die du auf YouTube findest, und hab sie beim Training immer griffbereit.
es: Guarda los mejores vídeos de ejercicios que encuentres en YouTube y tenlos justo al lado de tu entrenamiento.
pt_br: Salve os melhores vídeos de exercícios que encontrar no YouTube e deixe-os sempre à mão durante o treino.

source: Save the explanation that makes this exercise click for you.
de: Speichere die Erklärung, die dir diese Übung verständlich macht.
es: Guarda la explicación que te hace entender este ejercicio.
pt_br: Salve a explicação que faz este exercício fazer sentido para você.

source: Search
de: Suchen
es: Buscar
pt_br: Buscar

source: Search exercises
de: Übungen suchen
es: Buscar ejercicios
pt_br: Buscar exercícios

source: Search on YouTube
de: Auf YouTube suchen
es: Buscar en YouTube
pt_br: Buscar no YouTube

source: Search your exercises
de: Deine Übungen suchen
es: Buscar tus ejercicios
pt_br: Buscar seus exercícios

source: Search YouTube
de: Auf YouTube suchen
es: Buscar en YouTube
pt_br: Buscar no YouTube

source: Search YouTube coaching
de: Trainer auf YouTube suchen
es: Buscar entrenadores en YouTube
pt_br: Buscar treinadores no YouTube

source: Seat 4. Keep elbows slightly forward.
de: Sitz 4. Ellbogen leicht nach vorne.
es: Asiento 4. Mantén los codos ligeramente adelantados.
pt_br: Assento 4. Mantenha os cotovelos levemente à frente.

source: Seated Cable Row
de: Sitzendes Kabelrudern
es: Remo sentado en polea
pt_br: Remada sentada na polia

source: Seated Calf Raise
de: Sitzendes Wadenheben
es: Elevación de gemelos sentado
pt_br: Panturrilha sentado

source: SET
de: SATZ
es: SERIE
pt_br: SÉRIE

source: Set %lld
de: Satz %lld
es: Serie %lld
pt_br: Série %lld

source: Set as My Coach
de: Als meinen Trainer festlegen
es: Poner como mi entrenador
pt_br: Definir como meu treinador

source: Sets
de: Sätze
es: Series
pt_br: Séries

source: Shoulders
de: Schultern
es: Hombros
pt_br: Ombros

source: Skip
de: Überspringen
es: Saltar
pt_br: Pular

source: Skip for now
de: Jetzt nicht
es: Ahora no
pt_br: Agora não

source: Skip rest
de: Pause überspringen
es: Saltar descanso
pt_br: Pular descanso

source: Some experience
de: Ich habe etwas Erfahrung
es: Tengo algo de experiencia
pt_br: Tenho alguma experiência

source: Standing Calf Raise
de: Stehendes Wadenheben
es: Elevación de gemelos de pie
pt_br: Panturrilha em pé

source: Start coaching at a specific time
de: Video an einer bestimmten Stelle starten
es: Empezar el vídeo en un momento concreto
pt_br: Começar o vídeo em um momento específico

source: Start empty and build it your way.
de: Starte bei null und stell dir dein Training selbst zusammen.
es: Empieza desde cero y créalo a tu manera.
pt_br: Comece do zero e monte do seu jeito.

source: Start from a split
de: Mit einem Split starten
es: Empezar desde una rutina
pt_br: Começar por uma divisão

source: Start Workout
de: Training starten
es: Empezar entrenamiento
pt_br: Começar treino

source: Starts %@
de: Startet bei %@
es: Empieza en %@
pt_br: Começa em %@

source: Stationary Bike
de: Ergometer
es: Bicicleta estática
pt_br: Bicicleta ergométrica

source: That file couldn't be read.
de: Diese Datei konnte nicht gelesen werden.
es: No se pudo leer el archivo.
pt_br: Não foi possível ler o arquivo.

source: The classic 3-day strength split.
de: Der klassische 3-Tage-Kraft-Split.
es: La clásica rutina de fuerza de 3 días.
pt_br: A clássica divisão de força de 3 dias.

source: Theme
de: Design
es: Tema
pt_br: Tema

source: This removes the workout. Your logged history is kept.
de: Das entfernt das Training. Dein protokollierter Verlauf bleibt erhalten.
es: Esto elimina el entrenamiento. Tu historial registrado se conserva.
pt_br: Isto remove o treino. Seu histórico registrado é mantido.

source: This tunes starting suggestions. You can change anything later.
de: Das passt die Startvorschläge an. Du kannst später alles ändern.
es: Esto ajusta las sugerencias iniciales. Puedes cambiar todo después.
pt_br: Isto ajusta as sugestões iniciais. Você pode mudar tudo depois.

source: This week
de: Diese Woche
es: Esta semana
pt_br: Esta semana

source: This workout has no exercises.
de: Dieses Training hat keine Übungen.
es: Este entrenamiento no tiene ejercicios.
pt_br: Este treino não tem exercícios.

source: Today
de: Heute
es: Hoy
pt_br: Hoje

source: Train
de: Trainieren
es: Entrenar
pt_br: Treinar

source: Treadmill
de: Laufband
es: Cinta de correr
pt_br: Esteira

source: Triceps
de: Trizeps
es: Tríceps
pt_br: Tríceps

source: Triceps Pushdown
de: Trizepsdrücken am Kabel
es: Extensión de tríceps en polea
pt_br: Tríceps na polia

source: Try different words, or create a custom exercise.
de: Versuche andere Wörter oder erstelle eine eigene Übung.
es: Prueba con otras palabras o crea un ejercicio personalizado.
pt_br: Tente outras palavras ou crie um exercício personalizado.

source: Try different words, or paste a link you already have.
de: Versuche andere Wörter oder füge einen Link ein, den du schon hast.
es: Prueba con otras palabras o pega un enlace que ya tengas.
pt_br: Tente outras palavras ou cole um link que você já tem.

source: TubeTrainer has no account, no server and no analytics. Everything you log lives locally in the app and only leaves your device if you export a backup yourself. The app talks to YouTube only to find, preview and open coaching videos you choose. We never download or store the videos themselves — only links and basic metadata like the title and thumbnail. If you add your own YouTube API key for in-app search, it's stored locally on this device and used solely to talk to Google's YouTube service.
de: TubeTrainer hat kein Konto, keinen Server und keine Analytics. Alles, was du protokollierst, bleibt lokal in der App und verlässt dein Gerät nur, wenn du selbst ein Backup exportierst. Die App spricht mit YouTube nur, um die von dir gewählten Trainingsvideos zu finden, in der Vorschau zu zeigen und zu öffnen. Wir laden oder speichern die Videos nie selbst — nur Links und grundlegende Metadaten wie Titel und Vorschaubild. Wenn du deinen eigenen YouTube-API-Schlüssel für die In-App-Suche hinzufügst, wird er lokal auf diesem Gerät gespeichert und ausschließlich für die Kommunikation mit Googles YouTube-Dienst genutzt.
es: TubeTrainer no tiene cuenta, ni servidor, ni analíticas. Todo lo que registras vive localmente en la app y solo sale de tu dispositivo si exportas una copia de seguridad tú mismo. La app se conecta a YouTube solo para encontrar, previsualizar y abrir los vídeos de entrenamiento que elijas. Nunca descargamos ni almacenamos los vídeos: solo enlaces y datos básicos como el título y la miniatura. Si añades tu propia clave API de YouTube para la búsqueda en la app, se guarda localmente en este dispositivo y se usa únicamente para comunicarse con el servicio YouTube de Google.
pt_br: O TubeTrainer não tem conta, servidor nem analytics. Tudo o que você registra fica localmente no app e só sai do seu dispositivo se você exportar um backup. O app se conecta ao YouTube apenas para encontrar, pré-visualizar e abrir os vídeos de treino que você escolher. Nunca baixamos nem armazenamos os vídeos em si — apenas links e dados básicos como título e miniatura. Se você adicionar sua própria chave de API do YouTube para a busca no app, ela é salva localmente neste dispositivo e usada apenas para se comunicar com o serviço YouTube do Google.

source: Units
de: Einheiten
es: Unidades
pt_br: Unidades

source: Unknown error.
de: Unbekannter Fehler.
es: Error desconocido.
pt_br: Erro desconhecido.

source: Update key
de: Schlüssel aktualisieren
es: Actualizar clave
pt_br: Atualizar chave

source: Upper
de: Oberkörper
es: Tren superior
pt_br: Treino de superiores

source: Upper / Lower
de: Oberkörper / Unterkörper
es: Superior / Inferior
pt_br: Superior / Inferior

source: Use default
de: Standard verwenden
es: Usar predeterminado
pt_br: Usar padrão

source: Use this for %@?
de: Dies für %@ verwenden?
es: ¿Usar esto para %@?
pt_br: Usar isto para %@?

source: Video unavailable right now
de: Video derzeit nicht verfügbar
es: Vídeo no disponible ahora mismo
pt_br: Vídeo indisponível no momento

source: View plan
de: Plan ansehen
es: Ver plan
pt_br: Ver plano

source: Volume
de: Volumen
es: Volumen

source: Walking Lunge
de: Gehende Ausfallschritte
es: Zancadas caminando
pt_br: Afundo caminhando

source: We'll keep set targets simple.
de: Wir halten die Satzziele einfach.
es: Mantendremos los objetivos de series sencillos.
pt_br: Vamos manter as metas de séries simples.

source: We'll use it to greet you. Optional — you can add or change it anytime in You.
de: Wir nutzen ihn, um dich zu begrüßen. Optional — du kannst ihn jederzeit im Bereich „Du“ hinzufügen oder ändern.
es: Lo usaremos para saludarte. Opcional: puedes añadirlo o cambiarlo cuando quieras en Tú.
pt_br: Vamos usá-lo para te cumprimentar. Opcional — você pode adicionar ou mudar quando quiser na seção Você.

source: What should we call you?
de: Wie sollen wir dich nennen?
es: ¿Cómo te llamamos?
pt_br: Como devemos te chamar?

source: Who do you learn from?
de: Von wem lernst du?
es: ¿De quién aprendes?
pt_br: Com quem você aprende?

source: Working sets
de: Arbeitssätze
es: Series efectivas
pt_br: Séries de trabalho

source: WORKOUT
de: TRAINING
es: ENTRENAMIENTO
pt_br: TREINO

source: Workout name
de: Trainingsname
es: Nombre del entrenamiento
pt_br: Nome do treino

source: Workouts
de: Trainings
es: Entrenamientos
pt_br: Treinos

source: Yesterday
de: Gestern
es: Ayer
pt_br: Ontem

source: You
de: Du
es: Tú
pt_br: Você

source: You can change your chosen video whenever you like.
de: Du kannst dein gewähltes Video jederzeit ändern.
es: Puedes cambiar el vídeo elegido cuando quieras.
pt_br: Você pode trocar o vídeo escolhido quando quiser.

source: You know your way around.
de: Du kennst dich aus.
es: Ya sabes lo que haces.
pt_br: Você já sabe o que faz.

source: Your catalog looks empty.
de: Dein Katalog ist leer.
es: Tu catálogo está vacío.
pt_br: Seu catálogo está vazio.

source: Your coaches. Your exercises. Your progress.
de: Deine Trainer. Deine Übungen. Dein Fortschritt.
es: Tus entrenadores. Tus ejercicios. Tu progreso.
pt_br: Seus treinadores. Seus exercícios. Seu progresso.

source: Your coaching library
de: Deine Trainer-Bibliothek
es: Tu biblioteca de entrenadores
pt_br: Sua biblioteca de treinadores

source: Your existing data was not changed.
de: Deine vorhandenen Daten wurden nicht geändert.
es: Tus datos actuales no se modificaron.
pt_br: Seus dados atuais não foram alterados.

source: Your first session starts here
de: Dein erstes Training beginnt hier
es: Tu primera sesión empieza aquí
pt_br: Sua primeira sessão começa aqui

source: Your name
de: Dein Name
es: Tu nombre
pt_br: Seu nome

source: Your sets for %@ will show up here.
de: Deine Sätze für %@ erscheinen hier.
es: Tus series de %@ aparecerán aquí.
pt_br: Suas séries de %@ aparecerão aqui.

source: Your whole library is coached. Nice work.
de: Deine ganze Bibliothek hat Trainer. Stark!
es: Toda tu biblioteca tiene entrenador. ¡Buen trabajo!
pt_br: Toda a sua biblioteca tem treinador. Boa!

source: Your workouts
de: Deine Trainings
es: Tus entrenamientos
pt_br: Seus treinos

source: Your workouts stay on your device.
de: Deine Trainings bleiben auf deinem Gerät.
es: Tus entrenamientos se quedan en tu dispositivo.
pt_br: Seus treinos ficam no seu dispositivo.

source: YOUTUBE DATA API KEY
de: YOUTUBE-API-SCHLÜSSEL
es: CLAVE DE API DE YOUTUBE
pt_br: CHAVE DE API DO YOUTUBE

source: YouTube search
de: YouTube-Suche
es: Búsqueda de YouTube
pt_br: Busca do YouTube

source: YouTube search key
de: YouTube-Suchschlüssel
es: Clave de búsqueda de YouTube
pt_br: Chave de busca do YouTube

source: Band
es: Banda
pt_br: Elástico

source: Band Pull-Apart
es: Aperturas con banda
pt_br: Abertura com elástico

source: Bulgarian Split Squat
es: Sentadilla búlgara
pt_br: Agachamento búlgaro

source: Clean and Press
es: Cargada y press

source: Kettlebell Swing
es: Swing con kettlebell
pt_br: Swing com kettlebell

source: Name
es: Nombre
pt_br: Nome

source: Push / Pull / Legs
es: Empuje / Tirón / Piernas

source: Skull Crusher
es: Press francés
pt_br: Tríceps testa

source: System
es: Sistema
pt_br: Sistema

source: Training
es: Entrenamiento
pt_br: Treino

source: Version
es: Versión
pt_br: Versão

source: Video
es: Vídeo
pt_br: Vídeo

source: World's Greatest Stretch
es: El mejor estiramiento del mundo

source: Hip Thrust
pt_br: Elevação de quadril
